Tekla Open API Reference for Tekla Structures 2025
AnalysisRestraintData.UyType Property
 The restraint type for the displacement in the Y-axis direction.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisRestraintData.RestraintTypeEnum UyType { get; set; }
Public Property UyType As AnalysisRestraintData.RestraintTypeEnum
	Get
	Set
Property Value
Type: AnalysisRestraintData.RestraintTypeEnum
See Also
Reference
AnalysisRestraintData Class
Tekla.Structures.Analysis Namespace